presentation.org
#+AUTHOR: Cameron Gose
#+TITLE: Game from Start to Published!
#+OPTIONS: timestamp:nil toc:nil
#+REVEAL_PLUGINS: (highlight notes)
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
#+REVEAL_HIGHLIGHT_CSS: https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.6.0/styles/base16/windows-high-contrast.min.css

#+REVEAL_REVEAL_JS_VERSION: 4

* Introduction


* DragonRuby Game Toolkit
#+BEGIN_NOTES
First of all this is not a typo. DragonRuby is one word
#+END_NOTES
** Ruby
#+BEGIN_NOTES
It implements the standard Ruby language spec. DragonRuby is Ruby 2.x compatible, according to the documentation
#+END_NOTES
** Runtime
#+BEGIN_NOTES
DragonRuby is a multilevel cross-platform runtime. It can target PC, Mac, Linux, Raspberry Pi, WASM, iOS, Android, Nintendo Switch, Playstation, XBox, and VR on the Oculus Quest
#+END_NOTES

** Game Toolkit (GTK)
#+BEGIN_NOTES
DragonRuby GTK is a self contained 2D game engine. Where you don't need to learn a UI to use. It does have some 3D capabilities though.
#+END_NOTES

* Requirements
#+BEGIN_NOTES
3 things are really needed to run the GTK. Bring your own editor that supports Ruby
The DragonRuby GTK. It comes in a zipped folder so you just need to unzip it
Need a Linux,Mac,PC or a Raspberry Pi
#+END_NOTES
- BYOE
- DragonRuby GTK
- Linux/MacOS/Raspberry Pi/Windows

* How do you get it
#+BEGIN_NOTES
[[https://dragonruby.itch.io/dragonruby-gtk][itch.io]]
[[https://dragonruby.org/toolkit/game][DragonRuby.org]]
#+END_NOTES
* Initial Setup

- clone repo https://github.com/goseinthemachine/2022-ruby-conf-workshop
- go into the folder
- In the terminal run the following
#+begin_src bash
# For Mac or Linux
./dragonruby
# For Windows
dragonruby
#+end_src
* Let's Publish
#+BEGIN_NOTES
After completing Hello world it is now time to publish to itch.io.
Itch.io is a platform for selling and finding games and other digital content
DragonRuby GTK makes it fairly simple to publish games.
The first publish takes a little bit of work but after the initial setup every publish afterwards is super easy.
So we'll need to go to itch.io
Create an account if you don't have one already.
Now Let's login
Go to this link [[https://dragonruby.org/toolkit/game][New Game Link]]
Fill out the form keep note of the slug added to the game url. We'll need that to update the game metadata
#+END_NOTES
- Go to [[https://itch.io][itch.io]]
- Create an account if you haven't already
** Create the Landing Page
- Go to [[https://itch.io/game/new]]
- Add a title
- Add the project url
- Kind of project change to HTML
** Update Game Metadata
#+BEGIN_NOTES
In mygame/metadata/game_metadata insert something like the following but insert in your values
#+END_NOTES
#+begin_src text
devid=your_itch_io_user_name
devtitle=Your Name
gameid=ruby_conf_mini
gametitle=Ruby Conf Mini Workshop
version=0.1
#+end_src
** Building your game
#+BEGIN_NOTES
We'll be running the dragonruby-publish command
This command needs to be ran in the root of the cloned folder
mygame is the name of the folder to package up which will be mygame in our example
This will build all the executables and put them in a build folder in the root of DragonRuby
#+END_NOTES
#+begin_src bash
# Mac and Linux
./dragonruby-publish --only-package mygame
# Windows
dragonruby-publish --only-package mygame
#+end_src
* The Basics
#+BEGIN_NOTES
We're going to clear out the hello world example and setup the basic game loop
#+END_NOTES
** The Loop
#+BEGIN_NOTES
Every game has a loop that continuously loops over 3 functions. We'll handle user input, update the game state, then render to the screen
We'll create a function in our game for each part of the basic game loop
#+END_NOTES
- Handling Input
- Updating and Calculating Game State
- Rendering to the Screen
** The Loop
Clear main.rb and add the following
#+ATTR_REVEAL: :code_attribs data-line-numbers="1-3|5-9|11-15|17-21"
#+begin_src ruby
def handle_input args

end

# Functions that update game state will go here

def update args

end

# Functions that will render to the screen will go here

def render args

end

def tick args
  handle_input args
  update args
  render args
end
#+end_src

** Handle Input
#+ATTR_REVEAL: :code_attribs data-line-numbers="1-3"
#+begin_src ruby
def handle_input args
  #Code for handling user input will go here
end
#+end_src

** Update
#+BEGIN_NOTES
This function will be used to call other functions that will
update or calculate game state
#+END_NOTES
#+ATTR_REVEAL: :code_attribs data-line-numbers="1-3"
#+begin_src ruby
def update args
  #functions that update game state will go here
end
#+end_src
** Rendering to the screen
#+BEGIN_NOTES
This function will be used to call other render functions
to draw to the game window
#+END_NOTES
#+ATTR_REVEAL: :code_attribs data-line-numbers="1-3"
#+begin_src ruby
def render args
  # Code for rendering will occur here
end
#+end_src
** Tick
#+BEGIN_NOTES
We have these 3 functions now where do we put them?
In DragonRuby GTK there is a function that it looks for in main.rb
That is the tick function
The tick function is important it is called 60 times a second
This ensures a smooth framerate so animations looks smooth
#+END_NOTES
#+BEGIN_NOTES
We'll put the handle_input, render and update functions within tick
Each of these steps occur every time tick is called and each time that
happens the game check for user input, figures out what is going on, then
draws everything to the screen again. This happens every tick 60 times a second.
#+END_NOTES

#+ATTR_REVEAL: :code_attribs data-line-numbers="1-5"
#+begin_src ruby
def tick args # Will contain the GTK environment
  handle_input args
  update args
  render args
end
#+end_src
* Setting up the scene
#+BEGIN_NOTES
Now that we have the basics of the game loop defined in our code we can now start to build the game.
Today we will be building the classic arcade game of snake. In the classic game the snake moves along a grid.
Lets draw that grid.
#+END_NOTES
** Drawing the Grid
#+BEGIN_NOTES
To draw the grid we need to draw lines vertically along the x-axis and horizontally along the y-axis
#+END_NOTES
