presentation.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Game from Start to Published!</title>
<meta name="author" content="Cameron Gose"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/theme/moon.css" id="theme"/>

<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.6.0/styles/base16/windows-high-contrast.min.css"/></head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Game from Start to Published!</h1><p class="subtitle"></p>
<h2 class="author">Cameron Gose</h2>
</section>

<section>
<section id="slide-org84bace2">
<h2 id="org84bace2"><span class="section-number-2">1.</span> Introduction</h2>


</section>
</section>
<section>
<section id="slide-orgaa6eb4a">
<h2 id="orgaa6eb4a"><span class="section-number-2">2.</span> DragonRuby Game Toolkit</h2>
<aside class="notes">
<p>
First of all this is not a typo. DragonRuby is one word
</p>

</aside>
</section>
<section id="slide-orgcd936e7">
<h3 id="orgcd936e7"><span class="section-number-3">2.1.</span> Ruby</h3>
<aside class="notes">
<p>
It implements the standard Ruby language spec. DragonRuby is Ruby 2.x compatible, according to the documentation
</p>

</aside>
</section>
<section id="slide-orgda8ce76">
<h3 id="orgda8ce76"><span class="section-number-3">2.2.</span> Runtime</h3>
<aside class="notes">
<p>
DragonRuby is a multilevel cross-platform runtime. It can target PC, Mac, Linux, Raspberry Pi, WASM, iOS, Android, Nintendo Switch, Playstation, XBox, and VR on the Oculus Quest
</p>

</aside>

</section>
<section id="slide-orge144792">
<h3 id="orge144792"><span class="section-number-3">2.3.</span> Game Toolkit (GTK)</h3>
<aside class="notes">
<p>
DragonRuby GTK is a self contained 2D game engine. Where you don&rsquo;t need to learn a UI to use. It does have some 3D capabilities though.
</p>

</aside>

</section>
</section>
<section>
<section id="slide-org780f087">
<h2 id="org780f087"><span class="section-number-2">3.</span> Requirements</h2>
<aside class="notes">
<p>
3 things are really needed to run the GTK. Bring your own editor that supports Ruby
The DragonRuby GTK. It comes in a zipped folder so you just need to unzip it
Need a Linux,Mac,PC or a Raspberry Pi
</p>

</aside>
<ul>
<li>BYOE</li>
<li>DragonRuby GTK</li>
<li>Linux/MacOS/Raspberry Pi/Windows</li>

</ul>

</section>
</section>
<section>
<section id="slide-orgc58a85b">
<h2 id="orgc58a85b"><span class="section-number-2">4.</span> How do you get it</h2>
<aside class="notes">
<p>
<a href="https://dragonruby.itch.io/dragonruby-gtk">itch.io</a>
<a href="https://dragonruby.org/toolkit/game">DragonRuby.org</a>
</p>

</aside>
</section>
</section>
<section>
<section id="slide-orgafbcd08">
<h2 id="orgafbcd08"><span class="section-number-2">5.</span> Initial Setup</h2>
<ul>
<li>clone repo <a href="https://github.com/goseinthemachine/2022-ruby-conf-workshop">https://github.com/goseinthemachine/2022-ruby-conf-workshop</a></li>
<li>go into the folder</li>
<li>In the terminal run the following</li>

</ul>
<div class="org-src-container">

<pre   ><code class="bash" ># For Mac or Linux
./dragonruby
# For Windows
dragonruby
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org017d785">
<h2 id="org017d785"><span class="section-number-2">6.</span> Let&rsquo;s Publish</h2>
<aside class="notes">
<p>
After completing Hello world it is now time to publish to itch.io.
Itch.io is a platform for selling and finding games and other digital content
DragonRuby GTK makes it fairly simple to publish games.
The first publish takes a little bit of work but after the initial setup every publish afterwards is super easy.
So we&rsquo;ll need to go to itch.io
Create an account if you don&rsquo;t have one already.
Now Let&rsquo;s login
Go to this link <a href="https://dragonruby.org/toolkit/game">New Game Link</a>
Fill out the form keep note of the slug added to the game url. We&rsquo;ll need that to update the game metadata
</p>

</aside>
<ul>
<li>Go to <a href="https://itch.io">itch.io</a></li>
<li>Create an account if you haven&rsquo;t already</li>

</ul>
</section>
<section id="slide-org0d9760b">
<h3 id="org0d9760b"><span class="section-number-3">6.1.</span> Create the Landing Page</h3>
<ul>
<li>Go to <a href="https://itch.io/game/new">https://itch.io/game/new</a></li>
<li>Add a title</li>
<li>Add the project url</li>
<li>Kind of project change to HTML</li>

</ul>
</section>
<section id="slide-org4cd5b4d">
<h3 id="org4cd5b4d"><span class="section-number-3">6.2.</span> Update Game Metadata</h3>
<aside class="notes">
<p>
In mygame/metadata/game<sub>metadata</sub> insert something like the following but insert in your values
</p>

</aside>
<div class="org-src-container">

<pre   ><code class="text" >devid=your_itch_io_user_name
devtitle=Your Name
gameid=ruby_conf_mini
gametitle=Ruby Conf Mini Workshop
version=0.1
</code></pre>
</div>
</section>
<section id="slide-org8ade98a">
<h3 id="org8ade98a"><span class="section-number-3">6.3.</span> Building your game</h3>
<aside class="notes">
<p>
We&rsquo;ll be running the dragonruby-publish command
This command needs to be ran in the root of the cloned folder
mygame is the name of the folder to package up which will be mygame in our example
This will build all the executables and put them in a build folder in the root of DragonRuby
</p>

</aside>
<div class="org-src-container">

<pre   ><code class="bash" ># Mac and Linux
./dragonruby-publish --only-package mygame
# Windows
dragonruby-publish --only-package mygame
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-orga684d99">
<h2 id="orga684d99"><span class="section-number-2">7.</span> The Basics</h2>
<aside class="notes">
<p>
We&rsquo;re going to clear out the hello world example and setup the basic game loop
</p>

</aside>
</section>
<section id="slide-orgfa8f12a">
<h3 id="orgfa8f12a"><span class="section-number-3">7.1.</span> The Loop</h3>
<aside class="notes">
<p>
Every game has a loop that continuously loops over 3 functions. We&rsquo;ll handle user input, update the game state, then render to the screen
We&rsquo;ll create a function in our game for each part of the basic game loop
</p>

</aside>
<ul>
<li>Handling Input</li>
<li>Updating and Calculating Game State</li>
<li>Rendering to the Screen</li>

</ul>
</section>
<section id="slide-orgc75b7f0">
<h3 id="orgc75b7f0"><span class="section-number-3">7.2.</span> The Loop</h3>
<p>
Clear main.rb and add the following
</p>
<div class="org-src-container">

<pre   ><code class="ruby" data-line-numbers="1-3|5-9|11-15|17-21">def handle_input args

end

# Functions that update game state will go here

def update args

end

# Functions that will render to the screen will go here

def render args

end

def tick args
  handle_input args
  update args
  render args
end
</code></pre>
</div>

</section>
<section id="slide-orga766e7f">
<h3 id="orga766e7f"><span class="section-number-3">7.3.</span> Handle Input</h3>
<div class="org-src-container">

<pre   ><code class="ruby" data-line-numbers="1-3">def handle_input args
  #Code for handling user input will go here
end
</code></pre>
</div>

</section>
<section id="slide-orga1bd093">
<h3 id="orga1bd093"><span class="section-number-3">7.4.</span> Update</h3>
<aside class="notes">
<p>
This function will be used to call other functions that will
update or calculate game state
</p>

</aside>
<div class="org-src-container">

<pre   ><code class="ruby" data-line-numbers="1-3">def update args
  #functions that update game state will go here
end
</code></pre>
</div>
</section>
<section id="slide-org140f020">
<h3 id="org140f020"><span class="section-number-3">7.5.</span> Rendering to the screen</h3>
<aside class="notes">
<p>
This function will be used to call other render functions
to draw to the game window
</p>

</aside>
<div class="org-src-container">

<pre   ><code class="ruby" data-line-numbers="1-3">def render args
  # Code for rendering will occur here
end
</code></pre>
</div>
</section>
<section id="slide-org869dca5">
<h3 id="org869dca5"><span class="section-number-3">7.6.</span> Tick</h3>
<aside class="notes">
<p>
We have these 3 functions now where do we put them?
In DragonRuby GTK there is a function that it looks for in main.rb
That is the tick function
The tick function is important it is called 60 times a second
This ensures a smooth framerate so animations looks smooth
</p>

</aside>
<aside class="notes">
<p>
We&rsquo;ll put the handle<sub>input</sub>, render and update functions within tick
Each of these steps occur every time tick is called and each time that
happens the game check for user input, figures out what is going on, then
draws everything to the screen again. This happens every tick 60 times a second.
</p>

</aside>

<div class="org-src-container">

<pre   ><code class="ruby" data-line-numbers="1-5">def tick args # Will contain the GTK environment
  handle_input args
  update args
  render args
end
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org1029bf4">
<h2 id="org1029bf4"><span class="section-number-2">8.</span> Setting up the scene</h2>
<aside class="notes">
<p>
Now that we have the basics of the game loop defined in our code we can now start to build the game.
Today we will be building the classic arcade game of snake. In the classic game the snake moves along a grid.
Lets draw that grid.
</p>

</aside>
</section>
<section id="slide-org8fed773">
<h3 id="org8fed773"><span class="section-number-3">8.1.</span> Drawing the Grid</h3>
<aside class="notes">
<p>
To draw the grid we need to draw lines vertically along the x-axis and horizontally along the y-axis
</p>

</aside>
</section>
