presentation.org
*** Setting the Grid Size
#+BEGIN_NOTES
We need to define how far the grids should be spaced apart. At the top of the file create a constant to hold GRID SIZE to be equal to 20.
We'll be using GRID_SIZE to set the height and width of each square on the grid.
#+END_NOTES
#+ATTR_REVEAL: :code_attribs data-line-numbers="1|9-10|12-13"
#+BEGIN_SRC ruby
GRID_SIZE = 20

def handle_input args
end

def update args
end

def render_grid args
end

def render args
  render_grid args
end

def tick args
  handle_input args
  update args
  render args
end
#+END_SRC
*** Drawing lines along the X-Axis
#+BEGIN_NOTES
In render grid we are going to add in some code to draw along the x direction.
args.grid.x contains the width of the game window which in our case is 1080
First we'll determine how many lines we need to draw along the x-axis before drawing
DragonRuby GTK provide a nice way to draw lines
args.outputs has a collection call lines. If we append to the lines collection a hash that contains x, y, x2, y2 values
We can draw a line to the screen
#+END_NOTES
#+ATTR_REVEAL: :code_attribs data-line-numbers="9,20|10|12,19|13-18"
#+begin_src ruby
GRID_SIZE = 20

def handle_input args
end

def update args
end

def render_grid args
  x_axis = args.grid.w / GRID_SIZE

  x_axis.each_with_index do |x|
        args.outputs.lines << {
          x: x * GRID_SIZE,
          y: 0,
          x2: x * GRID_SIZE,
          y2: args.grid.h
        }
  end
end

def render args
  render_grid args
end

def tick args
  handle_input args
  update args
  render args
end

#+end_src
*** Drawing lines along the Y-Axis
#+ATTR_REVEAL: :code_attribs data-line-numbers="11|22-28"
#+begin_src ruby
GRID_SIZE = 20

def handle_input args
end

def update args
end

def render_grid args
  x_axis = args.grid.w / GRID_SIZE
  y_axis = args.grid.h / GRID_SIZE

  x_axis.each_with_index do |x|
    args.outputs.lines << {
      x: x * GRID_SIZE,
      y: 0,
      x2: x * GRID_SIZE,
      y2: args.grid.h
    }
  end

  y_axis.each_with_index do |y|
    args.outputs.lines << {
      x: 0,
      y: y * GRID_SIZE,
      x2: args.grid.w,
      y2: y * GRID_SIZE
    }
  end
end

def render args
  render_grid args
end

def tick args
  handle_input args
  update args
  render args
end

#+end_src

** Drawing the head of the snake
*** Setting up defaults
#+ATTR_REVEAL: :code_attribs data-line-numbers="37,48|38-47|51"
#+begin_src ruby
GRID_SIZE = 20

def handle_input args
end

def update args
end

def render_grid args
  x_axis = args.grid.w / GRID_SIZE
  y_axis = args.grid.h / GRID_SIZE
  x_axis.each_with_index do |x|
    args.outputs.lines <<
        {
          x: x * GRID_SIZE,
          y: 0,
          x2: x * GRID_SIZE,
          y2: args.grid.h
        }
  end

  y_axis.each_with_index do |y|
    args.outputs.lines <<
      {
        x: 0,
        y: y * GRID_SIZE,
        x2: args.grid.w,
        y2: y * GRID_SIZE
      }
  end
end

def render args
  render_grid args
end

def defaults args
  args.state.head ||=
  {
    x: args.grid.w / 2,
    y: args.grid.h / 2,
    w: GRID_SIZE,
    h: GRID_SIZE,
    r: 23,
    g: 245,
    b: 23,
  }
end

def tick args
  defaults args
  handle_input args
  update args
  render args
end
#+end_src
*** Rendering the Snake
#+ATTR_REVEAL: :code_attribs data-line-numbers="33-35|39"
#+begin_src ruby
GRID_SIZE = 20

def handle_input args
end

def update args
end

def render_grid args
  x_axis = args.grid.w / GRID_SIZE
  y_axis = args.grid.h / GRID_SIZE
  x_axis.each_with_index do |x|
    args.outputs.lines <<
        {
          x: x * GRID_SIZE,
          y: 0,
          x2: x * GRID_SIZE,
          y2: args.grid.h
        }
  end

  y_axis.each_with_index do |y|
    args.outputs.lines <<
      {
        x: 0,
        y: y * GRID_SIZE,
        x2: args.grid.w,
        y2: y * GRID_SIZE
      }
  end
end

def render_snake args
  args.outputs.solids << args.state.head
end

def render args
  render_grid args
  render_snake args
end

def defaults args
  args.state.head ||=
  {
    x: args.grid.w / 2,
    y: args.grid.h / 2,
    w: GRID_SIZE,
    h: GRID_SIZE,
    r: 23,
    g: 245,
    b: 23,
  }
end

def tick args
  defaults args
  handle_input args
  update args
  render args
end
#+end_src
* Adding Movement
** Handling player input
#+ATTR_REVEAL: :code_attribs data-line-numbers="3,16|4,5|7-15"
#+begin_src ruby
GRID_SIZE = 20

def handle_input args
  inputs = args.inputs
  head = args.state.head

  if inputs.left
    head.direction = :left
  elsif inputs.right
    head.direction = :right
  elsif inputs.up
    head.direction = :up
  elsif inputs.down
    head.direction = :down
  end
end

def update args
end

def render_grid args
  x_axis = args.grid.w / GRID_SIZE
  y_axis = args.grid.h / GRID_SIZE
  x_axis.each_with_index do |x|
    args.outputs.lines <<
        {
          x: x * GRID_SIZE,
          y: 0,
          x2: x * GRID_SIZE,
          y2: args.grid.h
        }
  end

  y_axis.each_with_index do |y|
    args.outputs.lines <<
      {
        x: 0,
        y: y * GRID_SIZE,
        x2: args.grid.w,
        y2: y * GRID_SIZE
      }
  end
end

def render_snake args
  args.outputs.solids << args.state.head
end

def render args
  render_grid args
  render_snake args
end

def defaults args
  args.state.head ||=
  {
    x: args.grid.w / 2,
    y: args.grid.h / 2,
    w: GRID_SIZE,
    h: GRID_SIZE,
    r: 23,
    g: 245,
    b: 23,
  }
end

def tick args
  defaults args
  handle_input args
  update args
  render args
end
#+end_src
