presentation.html
<section id="slide-orgf79d5e0">
<h4 id="orgf79d5e0"><span class="section-number-4">8.1.1.</span> Setting the Grid Size</h4>
<aside class="notes">
<p>
We need to define how far the grids should be spaced apart. At the top of the file create a constant to hold GRID SIZE to be equal to 20.
We&rsquo;ll be using GRID<sub>SIZE</sub> to set the height and width of each square on the grid.
</p>

</aside>
<div class="org-src-container">

<pre   ><code class="ruby" data-line-numbers="1|9-10|12-13">GRID_SIZE = 20

def handle_input args
end

def update args
end

def render_grid args
end

def render args
  render_grid args
end

def tick args
  handle_input args
  update args
  render args
end
</code></pre>
</div>
</section>
<section id="slide-org5acefb9">
<h4 id="org5acefb9"><span class="section-number-4">8.1.2.</span> Drawing lines along the X-Axis</h4>
<aside class="notes">
<p>
In render grid we are going to add in some code to draw along the x direction.
args.grid.x contains the width of the game window which in our case is 1080
First we&rsquo;ll determine how many lines we need to draw along the x-axis before drawing
DragonRuby GTK provide a nice way to draw lines
args.outputs has a collection call lines. If we append to the lines collection a hash that contains x, y, x2, y2 values
We can draw a line to the screen
</p>

</aside>
<div class="org-src-container">

<pre   ><code class="ruby" data-line-numbers="9,20|10|12,19|13-18">GRID_SIZE = 20

def handle_input args
end

def update args
end

def render_grid args
  x_axis = args.grid.w / GRID_SIZE

  x_axis.each_with_index do |x|
        args.outputs.lines &lt;&lt; {
          x: x * GRID_SIZE,
          y: 0,
          x2: x * GRID_SIZE,
          y2: args.grid.h
        }
  end
end

def render args
  render_grid args
end

def tick args
  handle_input args
  update args
  render args
end

</code></pre>
</div>
</section>
<section id="slide-orge494dd1">
<h4 id="orge494dd1"><span class="section-number-4">8.1.3.</span> Drawing lines along the Y-Axis</h4>
<div class="org-src-container">

<pre   ><code class="ruby" data-line-numbers="11|22-28">GRID_SIZE = 20

def handle_input args
end

def update args
end

def render_grid args
  x_axis = args.grid.w / GRID_SIZE
  y_axis = args.grid.h / GRID_SIZE

  x_axis.each_with_index do |x|
    args.outputs.lines &lt;&lt; {
      x: x * GRID_SIZE,
      y: 0,
      x2: x * GRID_SIZE,
      y2: args.grid.h
    }
  end

  y_axis.each_with_index do |y|
    args.outputs.lines &lt;&lt; {
      x: 0,
      y: y * GRID_SIZE,
      x2: args.grid.w,
      y2: y * GRID_SIZE
    }
  end
end

def render args
  render_grid args
end

def tick args
  handle_input args
  update args
  render args
end

</code></pre>
</div>

</section>
<section id="slide-orgb0dff37">
<h3 id="orgb0dff37"><span class="section-number-3">8.2.</span> Drawing the head of the snake</h3>
<div class="outline-text-3" id="text-8-2">
</div>
</section>
<section id="slide-org3d9b753">
<h4 id="org3d9b753"><span class="section-number-4">8.2.1.</span> Setting up defaults</h4>
<div class="org-src-container">

<pre   ><code class="ruby" data-line-numbers="37,48|38-47|51">GRID_SIZE = 20

def handle_input args
end

def update args
end

def render_grid args
  x_axis = args.grid.w / GRID_SIZE
  y_axis = args.grid.h / GRID_SIZE
  x_axis.each_with_index do |x|
    args.outputs.lines &lt;&lt;
        {
          x: x * GRID_SIZE,
          y: 0,
          x2: x * GRID_SIZE,
          y2: args.grid.h
        }
  end

  y_axis.each_with_index do |y|
    args.outputs.lines &lt;&lt;
      {
        x: 0,
        y: y * GRID_SIZE,
        x2: args.grid.w,
        y2: y * GRID_SIZE
      }
  end
end

def render args
  render_grid args
end

def defaults args
  args.state.head ||=
  {
    x: args.grid.w / 2,
    y: args.grid.h / 2,
    w: GRID_SIZE,
    h: GRID_SIZE,
    r: 23,
    g: 245,
    b: 23,
  }
end

def tick args
  defaults args
  handle_input args
  update args
  render args
end
</code></pre>
</div>
</section>
<section id="slide-org523b446">
<h4 id="org523b446"><span class="section-number-4">8.2.2.</span> Rendering the Snake</h4>
<div class="org-src-container">

<pre   ><code class="ruby" data-line-numbers="33-35|39">GRID_SIZE = 20

def handle_input args
end

def update args
end

def render_grid args
  x_axis = args.grid.w / GRID_SIZE
  y_axis = args.grid.h / GRID_SIZE
  x_axis.each_with_index do |x|
    args.outputs.lines &lt;&lt;
        {
          x: x * GRID_SIZE,
          y: 0,
          x2: x * GRID_SIZE,
          y2: args.grid.h
        }
  end

  y_axis.each_with_index do |y|
    args.outputs.lines &lt;&lt;
      {
        x: 0,
        y: y * GRID_SIZE,
        x2: args.grid.w,
        y2: y * GRID_SIZE
      }
  end
end

def render_snake args
  args.outputs.solids &lt;&lt; args.state.head
end

def render args
  render_grid args
  render_snake args
end

def defaults args
  args.state.head ||=
  {
    x: args.grid.w / 2,
    y: args.grid.h / 2,
    w: GRID_SIZE,
    h: GRID_SIZE,
    r: 23,
    g: 245,
    b: 23,
  }
end

def tick args
  defaults args
  handle_input args
  update args
  render args
end
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org42c4fc0">
<h2 id="org42c4fc0"><span class="section-number-2">9.</span> Adding Movement</h2>
<div class="outline-text-2" id="text-9">
</div>
</section>
<section id="slide-org4df80bb">
<h3 id="org4df80bb"><span class="section-number-3">9.1.</span> Handling player input</h3>
<div class="org-src-container">

<pre   ><code class="ruby" data-line-numbers="3,16|4,5|7-15">GRID_SIZE = 20

def handle_input args
  inputs = args.inputs
  head = args.state.head

  if inputs.left
    head.direction = :left
  elsif inputs.right
    head.direction = :right
  elsif inputs.up
    head.direction = :up
  elsif inputs.down
    head.direction = :down
  end
end

def update args
end

def render_grid args
  x_axis = args.grid.w / GRID_SIZE
  y_axis = args.grid.h / GRID_SIZE
  x_axis.each_with_index do |x|
    args.outputs.lines &lt;&lt;
        {
          x: x * GRID_SIZE,
          y: 0,
          x2: x * GRID_SIZE,
          y2: args.grid.h
        }
  end

  y_axis.each_with_index do |y|
    args.outputs.lines &lt;&lt;
      {
        x: 0,
        y: y * GRID_SIZE,
        x2: args.grid.w,
        y2: y * GRID_SIZE
      }
  end
end

def render_snake args
  args.outputs.solids &lt;&lt; args.state.head
end

def render args
  render_grid args
  render_snake args
end

def defaults args
  args.state.head ||=
  {
    x: args.grid.w / 2,
    y: args.grid.h / 2,
    w: GRID_SIZE,
    h: GRID_SIZE,
    r: 23,
    g: 245,
    b: 23,
  }
end

def tick args
  defaults args
  handle_input args
  update args
  render args
end
</code></pre>
</div>
</section>
