presentation.html
<section id="slide-orgf52f890">
<h3 id="orgf52f890"><span class="section-number-3">14.1.</span> Adding Game State</h3>
<div class="org-src-container">

<pre   ><code class="ruby" data-line-numbers="206">GRID_SIZE = 20
SPEED = 10

def handle_input args
  inputs = args.inputs
  head = args.state.head
  if args.tick_count.mod_zero? SPEED
    head.previous_direction = head.direction
    if inputs.left &amp;&amp; head.previous_direction != :right
      head.direction = :left
    elsif inputs.right &amp;&amp; head.previous_direction != :left
      head.direction = :right
    elsif inputs.up &amp;&amp; head.previous_direction != :down
      head.direction = :up
    elsif inputs.down &amp;&amp; head.previous_direction != :up
      head.direction = :down
    end
  end
end

def move_snake args
  snake = [args.state.head, *args.state.body]
  snake.each_with_index do |segment, index|
    segment.previous_direction = segment.direction unless index == 0
    segment.direction = snake[index - 1].previous_direction unless index == 0
    vector = { x: 0, y: 0 }
    case segment.direction
    when :right
      vector.x = 1
    when :left
      vector.x = -1
    when :down
      vector.y = -1
    when :up
      vector.y = 1
    end
    segment.x += GRID_SIZE * vector.x
    segment.y += GRID_SIZE * vector.y
  end
end

def handle_boundary_collision args
  walls = args.state.walls
  head = args.state.head
  if [walls.left, walls.right, walls.top, walls.bottom].any_intersect_rect?  args.state.head
